# 영화감독 숌 1 -> 영화감독 숌 2
# 시간 제한 2초 -> 0.5초

# 666 rule
# 사이클 1
# 0666 1666 2666 3666 4666 5666 -> 666 앞에 0부터 5까지 붙이기 # 0-5
# 6660 6661 6662 6663 6664 6665 6666 6667 6668 6669 -> 666 뒤에 0부터 9까지 붙이기 # 6-15
# 7666 8666 9666 -> 666 앞에 7부터 9가지 붙이기 # 16-18
######################################################################
# 사이클 2
# 10666 11666 12666 13666 14666 15666 -> 666 앞에 10부터 15까지 붙이기 # 19-24
# 16660 16661 16662 16663 16664 16665 16666 16667 16668 16669 -> 666 앞에 1 붙이고 뒤에 0부터 9까지 붙이기 # 25-34
# 17666 18666 19666 -> 666 앞에 17부터 19까지 붙이기 # 35-37
######################################################################
# 사이클 3
# 20666 21666 22666 23666 24666 25666 ... -> 666앞에 20부터 25까지 붙이기 # 38-43
# 26660 26661 26662 26663 26664 26665 26666 26667 26668 26669 -> 666 앞에 2 붙이고 뒤에 0부터 9까지 붙이기 # 44-53

number = int(input())
titlenumber = '0'
n = 0

while n < number:
    if int(str(n)[-1]) >= 0 and int(str(n)[-1]) < 6:
        titlenumber = str(n) + '666'
        n+= 1
    elif int(str(n)[-1]) == 6:
        for i in range(10):
            titlenumber = str(n)[:-1] + '666' + str(i)
            n += 1
    elif int(str(n)[-1]) > 6 and int(str(n)[-1]) < 10:
        titlenumber = str(n) + '666'
        n += 1

print(int(titlenumber))